// Напишите программу, кот. на вход принимает число и выдает его квадрат
// Например
// 4 -> 16
// -3 -> 9
// -7 -> 49

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());

Console.WriteLine(number*number);
